package lc.daily.date2209.Q672;

import java.util.HashSet;
import java.util.Set;

/**
 * 房间中有 n只已经打开的灯泡，编号从 1 到 n 。墙上挂着 4 个开关 。
 *
 * 这 4 个开关各自都具有不同的功能，其中：
 *
 * 开关 1 ：反转当前所有灯的状态（即开变为关，关变为开）
 * 开关 2 ：反转编号为偶数的灯的状态（即 2, 4, ...）
 * 开关 3 ：反转编号为奇数的灯的状态（即 1, 3, ...）
 * 开关 4 ：反转编号为 j = 3k + 1 的灯的状态，其中 k = 0, 1, 2, ...（即 1, 4, 7, 10, ...）
 * 你必须 恰好 按压开关 presses 次。每次按压，你都需要从 4 个开关中选出一个来执行按压操作。
 *
 * 给你两个整数 n 和 presses ，执行完所有按压之后，返回 不同可能状态 的数量。
 *
 *
 *
 * 示例 1：
 *
 * 输入：n = 1, presses = 1
 * 输出：2
 * 解释：状态可以是：
 * - 按压开关 1 ，[关]
 * - 按压开关 2 ，[开]
 *
 *
 * 示例 2：
 *
 * 输入：n = 2, presses = 1
 * 输出：3
 * 解释：状态可以是：
 * - 按压开关 1 ，[关, 关]
 * - 按压开关 2 ，[开, 关]
 * - 按压开关 3 ，[关, 开]
 *
 *
 * 示例 3：
 *
 * 输入：n = 3, presses = 1
 * 输出：4
 * 解释：状态可以是：
 * - 按压开关 1 ，[关, 关, 关]
 * - 按压开关 2 ，[关, 开, 关]
 * - 按压开关 3 ，[开, 关, 开]
 * - 按压开关 4 ，[关, 开, 开]
 *
 *
 * 提示：
 *
 * 1 <= n <= 1000
 * 0 <= presses <= 1000
 *
 * */

class Solution {
    // 周期 T == 6
    // 考虑6个灯泡受几号开关影响
    // 6k+1：1,3,4
    // 6k+2: 1,2
    // 6k+3: 1,3
    // 6k+4: 1,2,4
    // 6k+5: 1,3
    // 6k+6: 1,2
    // 6k+5 == 6k+3, 6k+6 == 6k+2, 所以只考虑4个灯泡
    // 假设开关分别按下a,b,c,d次，且按偶数次相当于没按，则灯泡状态有：
    // 1. 6k+1: (a+c+d)%2
    // 2. 6k+2: (a+b)%2
    // 3. 6k+3: (a+c)%2
    // 4. 6k+4: (a+b+d)%2
    // 发现4.由1. 2. 3. 决定
    // 因此只考虑3个灯泡
    public int flipLights(int n, int presses) {
        // 没按压，灯泡只有1种状态
        if (presses == 0) return 1;
        // 只有1个灯泡，按压1/3/4->关，按压2->开
        if (n == 1){
            return 2;
        }
        // 只有2个灯泡
        if (n == 2){
            return presses == 1 ? 3 : 4;
        }
        // 3个灯泡及以上
        // 按1次有4种，按2次有7种，按3次及以上8种
        return presses == 1 ? 4 : presses == 2 ? 7 : 8;
    }

}


public class Main {
}
